#+title: Laboratorium 8 - Układy równań – metody bezpośrednie
#+date: 06.05.2024r.
#+author: Piotr Karamon
#+setupfile: ../setupfile.org

** Finalny program
Finalny kod programu wykorzystuje stworzone powyżej funkcje:

#+begin_src python :session a :results output :wrap example
def main(n):
    try:
        lu_time = test_lu(n)
        inv_time = test_qr(n)
        qr_time = test_qr(n)
        print(f'LU = {lu_time:.6}s, INV = {inv_time:.6}s, QR = {qr_time:.6}s')
    except ValueError as e:
        print(f'PROCEDURE FAILED reason:{e}')

main(500)
#+end_src

#+RESULTS:
#+begin_example
LU = 0.0042225s, INV = 0.0243849s, QR = 0.0299737s
#+end_example


